import pandas as pd

from src.services import (
    best_cashback_categories,
    investment_bank,
    phone_number_search,
    search_for_transfers_to_individuals,
    simple_search,
)


def test_best_cashback_categories(xls_file_two):
    df_two = pd.DataFrame(xls_file_two)
    assert (
        best_cashback_categories(df_two, "2020", "12")
        == '{\n    "Остальное": 25,\n    "Переводы": 15,\n    "Наличные": 10\n}'
    )


def test_investment_bank(xls_file_one):
    assert investment_bank("2020-12", xls_file_one) == 43.0


def test_simple_search(xls_file_one):
    assert (
        simple_search(xls_file_one, "Чи")
        == """[
    {
        "Дата операции": "03.08.2020 18:42:49",
        "Дата платежа": "23.02.2020",
        "Номер карты": "*1419",
        "Статус": "OK",
        "Сумма операции": -159.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -159.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": "ЧикЧирик",
        "MCC": 5814.0,
        "Описание": "Baggins coffee",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    },
    {
        "Дата операции": "03.08.2018 18:42:49",
        "Дата платежа": "23.02.2020",
        "Номер карты": "*1419",
        "Статус": "OK",
        "Сумма операции": -59.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -59.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 0,
        "Категория": "Чирик",
        "MCC": 5815.0,
        "Описание": "Baggins coffee",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    }
]"""
    )


def test_phone_number_search(xls_file_three):
    assert (
        phone_number_search(xls_file_three)
        == """[
    {
        "Дата операции": "15.12.2020 16:48:46",
        "Дата платежа": "27.02.2020",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": 99.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 99.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 5,
        "Категория": "Granol",
        "MCC": 5810.0,
        "Описание": "MTASS +7 925 03-07-70",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    },
    {
        "Дата операции": "03.08.2020 18:42:49",
        "Дата платежа": "23.02.2020",
        "Номер карты": "*1419",
        "Статус": "OK",
        "Сумма операции": 159.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 159.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 50,
        "Категория": "ЧикЧирик",
        "MCC": 5814.0,
        "Описание": "BadNumber +100 744 00-00-01",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    }
]"""
    )


def test_search_for_transfers_to_individuals(xls_file_four):
    assert (
        search_for_transfers_to_individuals(xls_file_four)
        == """[
    {
        "Дата операции": "07.12.2020 21:52:04",
        "Дата платежа": "24.02.2020",
        "Номер карты": "*2351",
        "Статус": "OK",
        "Сумма операции": 650.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 650.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 10,
        "Категория": "Переводы",
        "MCC": 5811.0,
        "Описание": "Переводыч М.",
        "Бонусы (включая кэшбэк)": 13,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 650.0
    },
    {
        "Дата операции": "03.08.2020 18:42:49",
        "Дата платежа": "23.02.2020",
        "Номер карты": "*1419",
        "Статус": "OK",
        "Сумма операции": 159.0,
        "Валюта операции": "RUB",
        "Сумма платежа": 159.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": 50,
        "Категория": "Переводы",
        "MCC": 5814.0,
        "Описание": "Водколюб А.",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    }
]"""
    )
