import pandas as pd

from src.reports import expenses_by_category, spending_by_weekday, spending_of_wor_or_wee_days


def test_expenses_by_category(xls_file):
    df = pd.DataFrame(xls_file)
    result = expenses_by_category(df, "Фастфуд", "2021-01-15 00:00:00")
    assert (
        result
        == """[
    {
        "Дата операции": "15.12.2020 16:48:46",
        "Дата платежа": "27.02.2020",
        "Номер карты": "*7197",
        "Статус": "OK",
        "Сумма операции": -99.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -99.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "NaN",
        "Категория": "Фастфуд",
        "MCC": 5810.0,
        "Описание": "Granola",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    },
    {
        "Дата операции": "07.12.2020 21:52:04",
        "Дата платежа": "24.02.2020",
        "Номер карты": "*2351",
        "Статус": "OK",
        "Сумма операции": -650.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -650.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "NaN",
        "Категория": "Фастфуд",
        "MCC": 5811.0,
        "Описание": "Starbucks Coffee",
        "Бонусы (включая кэшбэк)": 13,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 650.0
    },
    {
        "Дата операции": "02.12.2020 18:42:49",
        "Дата платежа": "23.02.2020",
        "Номер карты": "*1419",
        "Статус": "OK",
        "Сумма операции": -99.0,
        "Валюта операции": "RUB",
        "Сумма платежа": -99.0,
        "Валюта платежа": "RUB",
        "Кэшбэк": "NaN",
        "Категория": "Фастфуд",
        "MCC": 5812.0,
        "Описание": "Baggins coffee",
        "Бонусы (включая кэшбэк)": 1,
        "Округление на инвесткопилку": 0,
        "Сумма операции с округлением": 99.0
    }
]"""
    )


def test_spending_by_weekday(xls_file_one):
    df = pd.DataFrame(xls_file_one)
    result = spending_by_weekday(df, "2020-12-15 00:00:00")
    assert (
        result
        == """[
    {
        "Понедельник": 650.0,
        "Вторник": 0.0,
        "Среда": 909.0,
        "Четверг": 99.0,
        "Пятница": 0.0,
        "Суббота": 0.0,
        "Воскресенье": 0.0
    }
]"""
    )


def test_spending_of_wor_or_wee_days(xls_file_five):
    df = pd.DataFrame(xls_file_five)
    result = spending_of_wor_or_wee_days(df, "2020-12-15 00:00:00")
    assert (
        result
        == """[
    {
        "workdays": 105.67,
        "weekdays": 909.0
    }
]"""
    )
